MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX430F064L.atdf
      <value-group caption="First Capture Edge Select bit" name="IC4CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC4CON__SIDL">
         <value caption="Halt in Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC4CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC5CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC5CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC5CON__ICOV">
         <value caption="Input capture overflow has occurred" name="" value="0x1" />
         <value caption="No input capture overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC5CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3" />
         <value caption="Interrupt on every third capture event" name="" value="0x2" />
         <value caption="Interrupt on every second capture event" name="" value="0x1" />
         <value caption="Interrupt on every capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Select bit" name="IC5CON__ICTMR">
         <value caption="Timer3 is the counter source for capture" name="" value="0x0" />
         <value caption="Timer2 is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC5CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC5CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC5CON__SIDL">
         <value caption="Halt in Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC5CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01618" name="INT" version="">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00010000" name="SS0" values="INTCON__SS0" />
         </register>
         <register caption="Interrupt Status Register" name="INTSTAT" offset="0x10" rw="RW" size="4">
            <bitfield caption="Interrupt Vector bits" mask="0x0000003F" name="VEC" values="INTSTAT__VEC" />
            <bitfield caption="Requested Priority Level bits" mask="0x00000700" name="SRIPL" values="INTSTAT__SRIPL" />
         </register>
         <register caption="Interrupt Proximity Timer Register" name="IPTMR" offset="0x20" rw="RW" size="4">
            <bitfield caption="Interrupt Proximity Timer Reload bits" mask="0xFFFFFFFF" name="IPTMR" values="IPTMR__IPTMR" />
         </register>
         <register caption="Interrupt Flag Status Register" name="IFS0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1EIF" />
            <bitfield mask="0x00000040" name="IC1IF" />
            <bitfield mask="0x00000080" name="OC1IF" />
            <bitfield mask="0x00000100" name="INT1IF" />
            <bitfield mask="0x00000200" name="T2IF" />
            <bitfield mask="0x00000400" name="IC2EIF" />
            <bitfield mask="0x00000800" name="IC2IF" />
            <bitfield mask="0x00001000" name="OC2IF" />
            <bitfield mask="0x00002000" name="INT2IF" />
            <bitfield mask="0x00004000" name="T3IF" />
            <bitfield mask="0x00008000" name="IC3EIF" />
            <bitfield mask="0x00010000" name="IC3IF" />
            <bitfield mask="0x00020000" name="OC3IF" />
            <bitfield mask="0x00040000" name="INT3IF" />
            <bitfield mask="0x00080000" name="T4IF" />
            <bitfield mask="0x00100000" name="IC4EIF" />
            <bitfield mask="0x00200000" name="IC4IF" />
            <bitfield mask="0x00400000" name="OC4IF" />
            <bitfield mask="0x00800000" name="INT4IF" />
            <bitfield mask="0x01000000" name="T5IF" />
            <bitfield mask="0x02000000" name="IC5EIF" />
            <bitfield mask="0x04000000" name="IC5IF" />
            <bitfield mask="0x08000000" name="OC5IF" />
            <bitfield mask="0x10000000" name="AD1IF" />
            <bitfield mask="0x20000000" name="FSCMIF" />
            <bitfield mask="0x40000000" name="RTCCIF" />
            <bitfield mask="0x80000000" name="FCEIF" />
         </register>
